// 1 Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої
// четверті години попадає число (в першу, другу, третю или четверту частину години).

let time= +prompt('Вкажіть хвилину від 0 до 59');
if (time >=0 && time <=14) {console.log('Перша чверть години');}
else if (time >=15 && time <=29){console.log('Друга чверть години');}
else if(time >=30 && time <=44){console.log('Третя чверть години');}
else if (time >=45 && time <=59){console.log('Четверта чверть години');}
else {console.log('Невірно вказані хвилини')}

// 2 У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day=+prompt('Вкажіть число місяця від 1 до 31');
if (day>=1 && day <=10){console.log('Перша декада місяця')}
else if (day>=11 && day <=20){console.log('Друга декада місяця')}
else if (day>=21 && day <=31){console.log('Третя декада місяця')}
else{console.log('Невірно вказан числа')}



// 3 У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test=true

// 4 Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

// 5 Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
// що заплановано на цей день.

// 6 Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// 7 Використовуючи конструкцію if..else, напишіть код, який запитуватиме:
// „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити:
// «Не знаєте? ECMAScript!