// 1 Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої
// четверті години попадає число (в першу, другу, третю или четверту частину години).

let time= +prompt('Вкажіть хвилину від 0 до 59');
if (time >=0 && time <=14) {console.log('Перша чверть години');}
else if (time >=15 && time <=29){console.log('Друга чверть години');}
else if(time >=30 && time <=44){console.log('Третя чверть години');}
else if (time >=45 && time <=59){console.log('Четверта чверть години');}
else {console.log('Невірно вказані хвилини')}

// 2 У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day=+prompt('Вкажіть число місяця від 1 до 31');
if (day>=1 && day <=10){console.log('Перша декада місяця')}
else if (day>=11 && day <=20){console.log('Друга декада місяця')}
else if (day>=21 && day <=31){console.log('Третя декада місяця')}
else{console.log('Невірно вказан числа')}



// 3 У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test=confirm('Запитання?') ? 'Вірно':'Невірно';
console.log(test)

// 4 Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a =+prompt('Введіть число')
if (a!==0){console.log('Вірно')}
else {console.log('Невірно')}

(a!==0)? console.log('Вірно'):console.log('Невірно')

// 5 Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
// що заплановано на цей день.
let dAy = +prompt('Введіть номер дня тижня')
switch (dAy) {case 1:console.log('Понеділок: курси');
    break;
    case 2:console.log('Вівторок: тренування на ноги');
        break;
    case 3:console.log('Середа:курси та розтяжка');
        break;
        case 4:console.log('Четвер: тренування прес ');
    break;
    case 5:console.log('Пятниця:курси');
        break;
    case 6:console.log('Субота: розтяжка');
        break;
        case 7:console.log('Неділя: чілл');
   break;
    default: console.log('Неправильний ввід')}

// 6 Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year=+prompt('Введіть кількість днів у році');
if (year/4===91){console.log('Високосний рік')}
else {console.log('Невисокосний рік')}

(year%4===0) ? console.log('Високосний рік'):console.log('Невисокосний рік');


// 7 Використовуючи конструкцію if..else, напишіть код, який запитуватиме:
// „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити:
// «Не знаєте? ECMAScript!
let name= prompt('Яка офіційна назва Javascript?')
if (name==='ECMAScript'){console.log('Правильно!')}
else {console.log('Не знаєте? ECMAScript!')}