// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor).
// Скласти результат цих чисел в змінній result.
let num10 = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1];
console.log(num10);
console.log(Math.random(num10) * 10);
let result = num10[0] + num10[1] + num10[2] + num10[3] + num10[4] + num10[5] + num10[6] + num10[7] + num10[8] + num10[9];
console.log(result);

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book1 = {
    name: 'Ніколи не їжте на одинці',
    pages: 350,
    genre: 'психологія'
};
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
let book2 = {
    name: 'Думай і багатій',
    pages: 278,
    genre: 'психологія',
    author: 'Наполеон Гілл'
};
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори.
let book = [book1, book2, book3 = {
    name: 'Голодні Ігри',
    pages: 298,
    genre: 'фантастика',
    author: ' Сюзанн Коллінз', book4: {
        name: '52 понеділки',
        pages: 210,
        genre: 'психологія',
        author: 'Вік Джонсон'
    }
}];

// Вивести кожну книгу як окремий об'єкт
console.log(book[0]);
console.log(book[1]);
console.log(book[2]);
console.log(book[2].book4);

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см.
// (змінна height) та шириною 10см (змінна width).Значення площі зберігати в змінній s.
let height = 23;
let width = 10;
let s = height * width;
console.log(s);

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
let heightC = 10;
let dC = 4;
let PI = 3.14;
let v = (PI * ((dC / 2) ** 2) * heightC);
console.log(parseInt(v));


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора
// (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
let n = 3;
let m = 4;
let k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));
console.log(k)