// 1 Створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// 2 Створити функцію яка обчислює та повертає площу кола з радіусом r
// 3 Створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// 4 Створити функцію яка приймає масив та виводить кожен його елемент
// 5 Створити функцію яка створює параграф з текстом. Текст задати через аргумент
// 6 Створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// 7 Створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// 8 Створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них
// список
// 9 Створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в
// документ. Для кожного об'єкту окремий блок.