// 1 Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель,
// виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// a) drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// b) info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// c) increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// d) changeYear (newValue) - змінює рік випуску на значення newValue
// e) addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car
//
// 2 (Те саме, тільки через клас) Створити клас який дозволяє створювати об'єкти car, з властивостями
// модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// a) drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// b) info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// c) increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// d) changeYear (newValue) - змінює рік випуску на значення newValue
// e) addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car
//
// 3 Створити класс/функцію конструктор попелюшка з полями ім'я, вік, розмір ноги.
// Створити масив з 10 попелюшок.

// 4 Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
// За допомоги циклу знайти яка попелюшка повинна бути з принцом.
// Додатково, знайти необхідну попелюшку за допомоги функції масиву find та відповідного колбеку
